.svn/pristine/f7/f7cfb1f87b89af39840fe6345ba9fc3af2cf7c93.svn-base

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:ns1="http://org.apache.axis2/xsd" xmlns:ns="http://serviceIndiv.webServiceCenter.sinosoft.com" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:ax2227="http://common.ehmservice.services.dto.webServiceCenter.sinosoft.com/xsd" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ax2226="http://ehmservice.services.dto.webServiceCenter.sinosoft.com/xsd" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" targetNamespace="http://serviceIndiv.webServiceCenter.sinosoft.com">
    <wsdl:documentation>CarPolicyQueryService</wsdl:documentation>
    <wsdl:types>
        <xs:schema xmlns:ax2228="http://common.ehmservice.services.dto.webServiceCenter.sinosoft.com/xsd" attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://ehmservice.services.dto.webServiceCenter.sinosoft.com/xsd">
            <xs:import namespace="http://common.ehmservice.services.dto.webServiceCenter.sinosoft.com/xsd"/>
            <xs:complexType name="CarPolicyQueryEhmRequest">
                <xs:sequence>
                    <xs:element minOccurs="0" name="engineNo" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="frameNo" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="licenseNo" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="operator" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="requestType" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="tXInsuranceRequestEhm" nillable="true" type="ax2227:TXInsuranceRequestEhm"/>
                    <xs:element minOccurs="0" name="tXInsuranceRequestExtensionEhm" nillable="true" type="ax2227:TXInsuranceRequestExtensionEhm"/>
                </xs:sequence>
            </xs:complexType>
            <xs:complexType name="CarPolicyQueryEhmResponse">
                <xs:sequence>
                    <xs:element maxOccurs="unbounded" minOccurs="0" name="carPolicyQueryList" nillable="true" type="ax2227:CarPolicyQuery"/>
                    <xs:element minOccurs="0" name="requestType" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="tXInsuranceResponseEhm" nillable="true" type="ax2227:TXInsuranceResponseEhm"/>
                    <xs:element minOccurs="0" name="tXInsuranceResponseExtensionEhm" nillable="true" type="ax2227:TXInsuranceResponseExtensionEhm"/>
                </xs:sequence>
            </xs:complexType>
        </xs:schema>
        <xs:schema xmlns:ax2229="http://ehmservice.services.dto.webServiceCenter.sinosoft.com/xsd" attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://serviceIndiv.webServiceCenter.sinosoft.com">
            <xs:import namespace="http://ehmservice.services.dto.webServiceCenter.sinosoft.com/xsd"/>
            <xs:element name="getPolicyQuery">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="ehmRequest" nillable="true" type="ax2226:CarPolicyQueryEhmRequest"/>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
            <xs:element name="getPolicyQueryResponse">
                <xs:complexType>
                    <xs:sequence>
                        <xs:element minOccurs="0" name="return" nillable="true" type="ax2226:CarPolicyQueryEhmResponse"/>
                    </xs:sequence>
                </xs:complexType>
            </xs:element>
        </xs:schema>
        <xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://common.ehmservice.services.dto.webServiceCenter.sinosoft.com/xsd">
            <xs:complexType name="TXInsuranceEhm">
                <xs:sequence>
                    <xs:element minOccurs="0" name="transExeDate" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="transExeTime" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="transRefGUID" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="transSubType" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="transType" nillable="true" type="xs:string"/>
                </xs:sequence>
            </xs:complexType>
            <xs:complexType name="TXInsuranceRequestEhm">
                <xs:complexContent>
                    <xs:extension base="ax2227:TXInsuranceEhm">
                        <xs:sequence>
                            <xs:element minOccurs="0" name="iInsuranceExtensionEhm" nillable="true" type="ax2227:IInsuranceExtensionEhm"/>
                        </xs:sequence>
                    </xs:extension>
                </xs:complexContent>
            </xs:complexType>
            <xs:complexType name="IInsuranceExtensionEhm">
                <xs:sequence>
                    <xs:element minOccurs="0" name="maxRecords" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="orderField" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="orderFlag" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="pageFlag" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="pageRowNum" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="rowNumStart" nillable="true" type="xs:string"/>
                </xs:sequence>
            </xs:complexType>
            <xs:complexType name="TXInsuranceExtensionEhm">
                <xs:sequence>
                    <xs:element minOccurs="0" name="operator" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="operatorKey" nillable="true" type="xs:string"/>
                </xs:sequence>
            </xs:complexType>
            <xs:complexType name="TXInsuranceRequestExtensionEhm">
                <xs:complexContent>
                    <xs:extension base="ax2227:TXInsuranceExtensionEhm">
                        <xs:sequence/>
                    </xs:extension>
                </xs:complexContent>
            </xs:complexType>
            <xs:complexType name="CarPolicyQuery">
                <xs:sequence>
                    <xs:element minOccurs="0" name="brandName" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="carKindCode" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="carOwner" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="channelType" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="endDate" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="engineNo" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="enrollDate" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="frameNo" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="handler1Code" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="handler1Name" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="handlerCode" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="handlerName" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="licenseNo" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="policyNo" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="riskCode" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="riskName" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="serviceCode" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="serviceName" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="startDate" nillable="true" type="xs:string"/>
                </xs:sequence>
            </xs:complexType>
            <xs:complexType name="TXInsuranceResponseEhm">
                <xs:sequence>
                    <xs:element minOccurs="0" name="transExeDate" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="transExeTime" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="transRefGUID" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="transResultEhm" nillable="true" type="ax2227:TransResultEhm"/>
                    <xs:element minOccurs="0" name="transSubType" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="transType" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="oInsuranceExtensionEhm" nillable="true" type="ax2227:OInsuranceExtensionEhm"/>
                </xs:sequence>
            </xs:complexType>
            <xs:complexType name="TransResultEhm">
                <xs:sequence>
                    <xs:element minOccurs="0" name="errorNo" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="errorType" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="resultCode" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="resultInfoDesc" nillable="true" type="xs:string"/>
                    <xs:element minOccurs="0" name="stackTrace" nillable="true" type="xs:string"/>
                </xs:sequence>
            </xs:complexType>
            <xs:complexType name="OInsuranceExtensionEhm">
                <xs:sequence>
                    <xs:element minOccurs="0" name="maxRecords" nillable="true" type="xs:string"/>
                </xs:sequence>
            </xs:complexType>
            <xs:complexType name="TXInsuranceResponseExtensionEhm">
                <xs:complexContent>
                    <xs:extension base="ax2227:TXInsuranceExtensionEhm">
                        <xs:sequence/>
                    </xs:extension>
                </xs:complexContent>
            </xs:complexType>
        </xs:schema>
    </wsdl:types>
    <wsdl:message name="getPolicyQueryRequest">
        <wsdl:part name="parameters" element="ns:getPolicyQuery"/>
    </wsdl:message>
    <wsdl:message name="getPolicyQueryResponse">
        <wsdl:part name="parameters" element="ns:getPolicyQueryResponse"/>
    </wsdl:message>
    <wsdl:portType name="CarPolicyQueryServicePortType">
        <wsdl:operation name="getPolicyQuery">
            <wsdl:input message="ns:getPolicyQueryRequest" wsaw:Action="urn:getPolicyQuery"/>
            <wsdl:output message="ns:getPolicyQueryResponse" wsaw:Action="urn:getPolicyQueryResponse"/>
        </wsdl:operation>
    </wsdl:portType>
    <wsdl:binding name="CarPolicyQueryServiceSoap11Binding" type="ns:CarPolicyQueryServicePortType">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <wsdl:operation name="getPolicyQuery">
            <soap:operation soapAction="urn:getPolicyQuery" style="document"/>
            <wsdl:input>
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:binding name="CarPolicyQueryServiceSoap12Binding" type="ns:CarPolicyQueryServicePortType">
        <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <wsdl:operation name="getPolicyQuery">
            <soap12:operation soapAction="urn:getPolicyQuery" style="document"/>
            <wsdl:input>
                <soap12:body use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap12:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:binding name="CarPolicyQueryServiceHttpBinding" type="ns:CarPolicyQueryServicePortType">
        <http:binding verb="POST"/>
        <wsdl:operation name="getPolicyQuery">
            <http:operation location="CarPolicyQueryService/getPolicyQuery"/>
            <wsdl:input>
                <mime:content type="text/xml" part="getPolicyQuery"/>
            </wsdl:input>
            <wsdl:output>
                <mime:content type="text/xml" part="getPolicyQuery"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="CarPolicyQueryService">
        <wsdl:port name="CarPolicyQueryServiceHttpSoap11Endpoint" binding="ns:CarPolicyQueryServiceSoap11Binding">
            <soap:address location="http://9.23.22.176:7001/webServiceCenter/services/CarPolicyQueryService.CarPolicyQueryServiceHttpSoap11Endpoint/"/>
        </wsdl:port>
        <wsdl:port name="CarPolicyQueryServiceHttpSoap12Endpoint" binding="ns:CarPolicyQueryServiceSoap12Binding">
            <soap12:address location="http://9.23.22.176:7001/webServiceCenter/services/CarPolicyQueryService.CarPolicyQueryServiceHttpSoap12Endpoint/"/>
        </wsdl:port>
        <wsdl:port name="CarPolicyQueryServiceHttpEndpoint" binding="ns:CarPolicyQueryServiceHttpBinding">
            <http:address location="http://9.23.22.176:7001/webServiceCenter/services/CarPolicyQueryService.CarPolicyQueryServiceHttpEndpoint/"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>
